/*
Өгөгдсөн нэг хэмжээст бүхэл тоон массив дахь хамгийн их элементийг / тоог / ол.

Input
Эхний мөрөнд массивын элементийн тоо өгөгдөнө.

Дараагийн мөрөнд массивын элементүүд / бүхэл тоо / зайгаар тусгаарлагдан өгөгдөнө. 

Output
Хамгийн их тоо.
3 -2 4 7 -6

*/
#include<stdio.h>
int main()
{
    int n,i,max,maxIndex;
    scanf("%d",&n);
    int a[n];
    for(i=0;i<n;i++)
    {
        scanf("%d",&a[i]);
    }
    max=a[0];
    for(i=1;i<n;i++)
    {
        if(a[i]>max)
        {
            max=a[i];
        }
    }
    printf("%d", max);
}